// лаб 5
#include "stdafx.h"
#include <iostream>
#include <cmath>
#define stop system("pause")

using namespace std;

int a[15] = {2,3,8,1,6,4,7,5,9,12,14,23,11};
int pmin = 0;
int pmax = 0;
int emin = a[0];
int emax = a[0];
/**/
int b[12] = {-2,3,-4,1,-5,4,-2,2,-8,6,-6,4};
int s = 0, p = 1;

/**/
int c[10] = { -2,3,-4,1,-5,4,-2,2,-8,6};
int n = 0;
/**/
void nop(void) {}

int main()
{
	setlocale(LC_ALL, "");
	/*------------------------------------*/
	cout << " вычислить среднее геометрическое номеров максимального и минимального эл-тов массива\n\n";
	for (int i = 0; i < 15; i++) {
		cout << a[i] << "\t";
		emin > a[i] ? emin = a[i], pmin = i : nop();
		emax < a[i] ? emax = a[i], pmax = i : nop();
	}
	cout << "\n\n";

	cout << " номер максимального = "<<pmin<<"\n";
	cout << " номер минимального  = "<<pmax << "\n";
	cout << " среднее геометрическое  = " << sqrt(pmax*pmin) << "\n" << "\n";
	/*------------------------------------*/
	cout << " найти разность суммы положительных и произведения отрицательных эл-тов массива\n\n";
	for (int i = 0; i < 12; i++) {
		cout << b[i] << "\t";
		a[i] > 0 ? s += a[i] : nop();
		a[i] < 0 ? p *= a[i] : nop();
	}
	cout << "\n\n";
	cout << " сумма положительных = " << s << "\n";
	cout << " произведение отрицательных  = " << p << "\n";
	cout << " их разность  = " << s-p << "\n" << "\n";
	/*------------------------------------*/
	cout << " найти количество положительных эл-тов массива\n\n";
	for (int i = 0; i < 10; i++) {
		c[i] > 0 ? n++, cout << c[i] <<"\t" : cout << c[i] << "\t";
	}
	cout << "\n" << "\n";
	cout << " количество положительных элементов = " << n << "\n\n";


	stop;
    return 0;
}

