// lab 2 var 1
#include "stdafx.h"
#include <iostream>
#include <cmath>
#define stop system("pause")

using namespace std;

int a[5][5] = {3,2,4,5,6,1,2,3,4,23,4,5,12,2,33,14,34,12,32,12,7,8,22,23,34};
int min[3];
int b[3][9] = { 3,2,4,5,6,1,2,3,4,23,4,5,12,2,33,14,34,12,32,12,7,8,22,23,34,0,2};
int p=1, s=0;
void nop(void) {}

int main()
{
	setlocale(LC_ALL, "");
	/*
	*/
	// а) найти квадрат минимального элемента и номер строки и столбца где он находится
	/* */
	min[0] = a[0][0];
	min[1] = 0;
	min[2] = 0;

	for (int i = 0; i < 5; i++)
		for (int j = 0; j < 5; j++)
			a[i][j] < min[0] ? min[0] = a[i][j], min[1] = i, min[2] = j : nop();
	for (int i = 0; i < 5; i++) {
		for (int j = 0; j < 5; j++) {
			cout << a[i][j] << "\t" << "";
		}
		cout << "\n";
	}
	cout << "Минимальный элемент = " << min[0] << ", в строке " << min[1] << ", позиция " << min[2] + 1 << "\n\n";
	/**/
// б) в матрице b(3,9) найти разность произведения нечетных чисел 2й строки и суммы положительных чисел 6го столбца
/**/
	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 9; j++) {
		cout << b[i][j] << "\t" << "";
	}
	cout << "\n";
}
	cout <<"\n\n";
	for (int j = 0; j < 9; j++) b[1][j]%2==1?p *= b[1][j]:p=p;
	for (int i = 0; i < 3; i++) b[i][5]>0?s += b[i][5]:p=p;
	cout << "произведение нечетных чисел 2й строки  = " << p <<"\n";
	cout << "сумма положительных чисел 6го столбца = " << s << "\n";
	cout << "их разность = " << p - s << "\n\n";
/**/

	stop;
	return 0;
}

